                Pandas DataFrame

A. Series Object

In [3]:

import pandas as pd
data = [1,2,3,4]
series1 = pd.Series(data)
series1

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
type(series1)

pandas.core.series.Series

Ubah nama index

In [5]:
series1 = pd.Series(data, index = ['a','b','c','d'])
series1

a    1
b    2
c    3
d    4
dtype: int64

B. DataFrame

1. menggunakan List

In [7]:
data = [1,2,3,4]
df = pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4

2. menggunakan dictionary

In [8]:
dictionary = {'buah' : ['Apel', 'Jeruk', 'Lemon'], 'jumlah' : [8, 2, 7]}
df = pd.DataFrame(dictionary)
df

    buah  jumlah
0   Apel       8
1  Jeruk       2
2  Lemon       7

3. menggunakan List dengan tipe data campuran

In [15]:
data = [['Armando',90,85,95,90.5],
        ['Joemama',80,85,83,80.2],
        ['Ligma',70,78,82,77.6]]
index = [0,1,2]
kolom = ['Nama','Tugas','UTS','UAS','Rata-rata']
df =pd.DataFrame(data, index, kolom)
df

      Nama  Tugas  UTS  UAS  Rata-rata
0  Armando     90   85   95       90.5
1  Joemama     80   85   83       80.2
2    Ligma     70   78   82       77.6

4. DataFrame menggunakan Dictionary dengan type data campuran

In [16]:
nama = ['Armando','Joemama','Ligma']
tugas = [90,80,70]
uts = [85,85,78]
uas = [95,83,82]
ratarata = [90.5,80.2,77.6]
df = pd.DataFrame({'Nama':nama,'Tugas':tugas,'UTS':uts,'UAS':uas,"Rata-rata":ratarata})
df

      Nama  Tugas  UTS  UAS  Rata-rata
0  Armando     90   85   95       90.5
1  Joemama     80   85   83       80.2
2    Ligma     70   78   82       77.6

C. Merge, Join, Concatenate DataFrame

1. Merge

In [17]:
#Data Pertama
nama = ['Armando','Joemama','Ligma']
tugas = [90,80,70]
jurusan = ['IF',"IT","TM"]
df1 = pd.DataFrame({'Nama':nama,'Tugas':tugas,'Jurusan':jurusan})
df1

      Nama  Tugas Jurusan
0  Armando     90      IF
1  Joemama     80      IT
2    Ligma     70      TM

In [21]:
#Data Kedua
nama = ['Armando','Joemama','Ligma']
uts = [85,85,78]
jurusan = ['IF',"IT","TM"]
df2 = pd.DataFrame({'Nama':nama,'UTS':uts,'Jurusan':jurusan})
df2

      Nama  UTS Jurusan
0  Armando   85      IF
1  Joemama   85      IT
2    Ligma   78      TM

In [23]:
# Inner Merge
df1.merge(df2)

      Nama  Tugas Jurusan  UTS
0  Armando     90      IF   85
1  Joemama     80      IT   85
2    Ligma     70      TM   78

In [24]:
# Left Merge
df1.merge(df2, on='Nama', how='left')

      Nama  Tugas Jurusan_x  UTS Jurusan_y
0  Armando     90        IF   85        IF
1  Joemama     80        IT   85        IT
2    Ligma     70        TM   78        TM

In [26]:
# Right Merge
df1.merge(df2, on='Nama', how='right')

      Nama  Tugas Jurusan_x  UTS Jurusan_y
0  Armando     90        IF   85        IF
1  Joemama     80        IT   85        IT
2    Ligma     70        TM   78        TM

In [27]:
# Outer Merge
df1.merge(df2, on='Nama', how='outer')

      Nama  Tugas Jurusan_x  UTS Jurusan_y
0  Armando     90        IF   85        IF
1  Joemama     80        IT   85        IT
2    Ligma     70        TM   78        TM

2. Join

In [48]:
#Data Pertama
nama = ['Armando','Joemama','Ligma']
tugas = [90,80,70]
jurusan = ['IF',"IT","TM"]
df1 = pd.DataFrame({'Nama':nama,'Tugas':tugas,'Jurusan':jurusan}, index=['L1','L2','L3'])
df1

       Nama  Tugas Jurusan
L1  Armando     90      IF
L2  Joemama     80      IT
L3    Ligma     70      TM

In [55]:
#Data Kedua
nama = ['Joemama','Ligma','Saskehh']
uts = [85,85,78]
jurusan = ['IF',"IT","TM"]
df2 = pd.DataFrame({'Nama B':nama,'UTS':uts,'Jurusan B':jurusan}, index=['L2','L3','L4'])
df2

     Nama B  UTS Jurusan B
L2  Joemama   85        IF
L3    Ligma   85        IT
L4  Saskehh   78        TM

In [61]:
# Inner Join
df1.join(df2, how='inner')

       Nama  Tugas Jurusan   Nama B  UTS Jurusan B
L2  Joemama     80      IT  Joemama   85        IF
L3    Ligma     70      TM    Ligma   85        IT

In [62]:
# Left Join
df1.join(df2, how='left')

       Nama  Tugas Jurusan   Nama B   UTS Jurusan B
L1  Armando     90      IF      NaN   NaN       NaN
L2  Joemama     80      IT  Joemama  85.0        IF
L3    Ligma     70      TM    Ligma  85.0        IT

In [63]:
# Right Join
df1.join(df2, how='right')

       Nama  Tugas Jurusan   Nama B  UTS Jurusan B
L2  Joemama   80.0      IT  Joemama   85        IF
L3    Ligma   70.0      TM    Ligma   85        IT
L4      NaN    NaN     NaN  Saskehh   78        TM

In [64]:
# outer Join
df1.join(df2, how='outer')

       Nama  Tugas Jurusan   Nama B   UTS Jurusan B
L1  Armando   90.0      IF      NaN   NaN       NaN
L2  Joemama   80.0      IT  Joemama  85.0        IF
L3    Ligma   70.0      TM    Ligma  85.0        IT
L4      NaN    NaN     NaN  Saskehh  78.0        TM

3. Concatenate

In [65]:
pd.concat([df1,df2], sort='False')

C:\Users\afy\AppData\Local\Temp\ipykernel_9148\2450548304.py:1: FutureWarning: Passing non boolean values for sort is deprecated and will error in a future version!
  pd.concat([df1,df2], sort='False')

   Jurusan Jurusan B     Nama   Nama B  Tugas   UTS
L1      IF       NaN  Armando      NaN   90.0   NaN
L2      IT       NaN  Joemama      NaN   80.0   NaN
L3      TM       NaN    Ligma      NaN   70.0   NaN
L2     NaN        IF      NaN  Joemama    NaN  85.0
L3     NaN        IT      NaN    Ligma    NaN  85.0
L4     NaN        TM      NaN  Saskehh    NaN  78.0